artillery/00_auth_test.yaml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 60
      arrivalRate: 5

scenarios:
  - name: 'Sign Up'
    flow:
      - post:
          url: '/auth/sign-up'
          headers:
            Content-Type: 'application/json'
          json:
            email: 'user@example.com'
            name: 'John Doe'
            password: 'password123'
            verificationCode: 123456
            provider: ''  
            socialId: ''  
          capture:
            - json: '$.data.id'
              as: 'userId'

  - name: 'Sign In'
    flow:
      - post:
          url: '/auth/sign-in'
          headers:
            Content-Type: 'application/json'
          json:
            email: 'user@example.com'
            password: 'password123'
          capture:
            - json: '$.accessToken'
              as: 'accessToken'
            - json: '$.refreshToken'
              as: 'refreshToken'

  - name: 'Sign Out'
    flow:
      - patch:
          url: '/auth/sign-out'
          headers:
            Content-Type: 'application/json'
            Authorization: 'Bearer {{ accessToken }}'
          capture:
            - json: '$.message'
              as: 'signOutMessage'