artillery/00_auth_test.yaml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 60  # 테스트 지속 시간 (초)
      arrivalRate: 10  # 초당 요청 수
  defaults:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36'

scenarios:
  - name: 'User Flow'
    flow:
      - post:
          url: '/api/v1/auth/sign-in'
          headers:
            Content-Type: 'application/json'
            X-Forwarded-For: '192.168.0.1'
          json:
            email: 'user1@example.com'
            password: 'qwer1234'
          capture:
            - json: '$.accessToken'
              as: 'accessToken'
            - json: '$.refreshToken'
              as: 'refreshToken'