artillery/01_notice_test.yaml
config:
  target: 'http://127.0.0.1:3333'
  phases:
    - duration: 60
      arrivalRate: 1
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './functions.mjs'  # 사용자 정의 함수 파일 경로

scenarios:
  - name: 'Fetch Notices Page 1'
    flow:
      - get:
          url: '/api/v1/notices'
          qs:
            page: 1
            limit: 2
          capture:
            - json: '$.data'
              as: 'notices'
  beforeRequest: beforeRequestWithUser('vlsual0917_gmail_com')

  - name: 'Fetch Notices Page 3'
    flow:
      - get:
          url: '/api/v1/notices'
          qs:
            page: 3
            limit: 2
          capture:
            - json: '$.data'
              as: 'notices'
  beforeRequest: beforeRequestWithUser('vlsual0917_gmail_com')
      
  - name: 'Fetch Jobs'
    flow:
      - get:
          url: '/api/v1/jobs'
          capture:
            - json: '$.jobs'
              as: 'jobs'
  beforeRequest: beforeRequestWithUser('vlsual0917_gmail_com')